cases/OpenFOAM/incompressible/lumpedPointMotion/building/steady/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    meshTools
    lumpedPointMotion
    fvMotionSolvers
);

application     simpleFoam;     // Change to pimpleFoam for transient

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.01;

deltaT          1e-4;

writeControl    timeStep;

writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

// These can be a bit larger when we restart from steady-state
maxCo           0.75;

maxDeltaT       0.01;


// Embed steady-state settings (simpleFoam) without changeDictionary
_simpleFoam
{
    endTime         500;
    writeInterval   100;
    deltaT          1;
    adjustTimeStep  no;
}

${_${FOAM_EXECUTABLE}};

#remove _simpleFoam

functions
{
}


// ************************************************************************* //
